# AceleraDev Codenation - Semana 2

## Joanes Miranda de Souto - Data Scientist

## Manipulando dados

In [594]:
#importando os pacotes
import pandas as pd
import numpy as np

In [595]:
#acessando o help dos pacotes
pd?

## Dicionarios

In [596]:
#Criando um dicionario com os dados
dados = {
    'canal_vendas': ['facebook','twitter', 'instagram', 'linkdim', 'facebook'],
    'acessos': [100,200,300,400,500],
    'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
    'vendas': [1000.52,1052.34,2002,5000,300]
}

In [597]:
#para printar o dicionario
dados

{'canal_vendas': ['facebook', 'twitter', 'instagram', 'linkdim', 'facebook'],
 'acessos': [100, 200, 300, 400, 500],
 'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300]}

In [598]:
#verificando o tipo do dicionario
type(dados)

dict

In [599]:
#Acessando as chaves do meu dicionario
dados.keys()

dict_keys(['canal_vendas', 'acessos', 'site', 'vendas'])

In [600]:
#acessando uma chave especifica
dados['site']

['site1', 'site1', 'site2', 'site2', 'site3']

In [601]:
#acessando uma posição especifica
dados['canal_vendas'][2]

'instagram'

In [602]:
#acessando uma posição especifica
dados['canal_vendas'][:2]

['facebook', 'twitter']

## Listas

In [603]:
#Criando uma lista
lista = [200,200,300,800,500]

In [604]:
#printando uma lista
lista

[200, 200, 300, 800, 500]

In [605]:
#vendo valores especificos
lista[2]

300

In [606]:
#fatia da lista
lista[:3]

[200, 200, 300]

In [607]:
#adicionando lista ao dicionario
dados['lista'] = lista

In [608]:
#exibindo a lista com os novos valores
dados

{'canal_vendas': ['facebook', 'twitter', 'instagram', 'linkdim', 'facebook'],
 'acessos': [100, 200, 300, 400, 500],
 'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300],
 'lista': [200, 200, 300, 800, 500]}

## DataFrames

In [609]:
#criar um dataframe  apartir de um dicionario
dataframe = pd.DataFrame(dados)

In [610]:
#acessando o dataframe
dataframe

  canal_vendas  acessos   site   vendas  lista
0     facebook      100  site1  1000.52    200
1      twitter      200  site1  1052.34    200
2    instagram      300  site2  2002.00    300
3      linkdim      400  site2  5000.00    800
4     facebook      500  site3   300.00    500

In [611]:
#exibindo as primeiras linhas do dataframe
dataframe.head()

  canal_vendas  acessos   site   vendas  lista
0     facebook      100  site1  1000.52    200
1      twitter      200  site1  1052.34    200
2    instagram      300  site2  2002.00    300
3      linkdim      400  site2  5000.00    800
4     facebook      500  site3   300.00    500

In [612]:
#verificando o formato do dataframe
dataframe.shape

(5, 5)

In [613]:
#verificando o indice do dataframe
dataframe.index

RangeIndex(start=0, stop=5, step=1)

In [614]:
#verificando os tipos de dados do dataframe
dataframe.dtypes

canal_vendas     object
acessos           int64
site             object
vendas          float64
lista             int64
dtype: object

In [615]:
#verificando se exitem valores faltantes
dataframe.isna().sum()

canal_vendas    0
acessos         0
site            0
vendas          0
lista           0
dtype: int64

In [616]:
#printando os nomes das colunas
dataframe.columns

Index(['canal_vendas', 'acessos', 'site', 'vendas', 'lista'], dtype='object')

In [617]:
#acessando uma coluna especifica
dataframe['canal_vendas']

0     facebook
1      twitter
2    instagram
3      linkdim
4     facebook
Name: canal_vendas, dtype: object

In [618]:
#criando uma nova coluna
dataframe['nova_coluna'] = [1,2,3,4,5]

In [619]:
dataframe.head()

  canal_vendas  acessos   site   vendas  lista  nova_coluna
0     facebook      100  site1  1000.52    200            1
1      twitter      200  site1  1052.34    200            2
2    instagram      300  site2  2002.00    300            3
3      linkdim      400  site2  5000.00    800            4
4     facebook      500  site3   300.00    500            5

In [620]:
dataframe.columns

Index(['canal_vendas', 'acessos', 'site', 'vendas', 'lista', 'nova_coluna'], dtype='object')

In [621]:
#removendo colunas
dataframe.drop('nova_coluna', axis=1, inplace=True)

In [622]:
dataframe

  canal_vendas  acessos   site   vendas  lista
0     facebook      100  site1  1000.52    200
1      twitter      200  site1  1052.34    200
2    instagram      300  site2  2002.00    300
3      linkdim      400  site2  5000.00    800
4     facebook      500  site3   300.00    500

In [623]:
#removendo mais de uma coluna
dataframe.drop(columns=['canal_vendas','site'])

   acessos   vendas  lista
0      100  1000.52    200
1      200  1052.34    200
2      300  2002.00    300
3      400  5000.00    800
4      500   300.00    500

In [624]:
#mostrando as colunas
dataframe.columns

Index(['canal_vendas', 'acessos', 'site', 'vendas', 'lista'], dtype='object')

In [625]:
#acessando valores especificos
dataframe['canal_vendas'][3]

'linkdim'

In [626]:
#acessando fatia de coluna especifica
dataframe['canal_vendas'][:2]

0    facebook
1     twitter
Name: canal_vendas, dtype: object

In [627]:
dataframe

  canal_vendas  acessos   site   vendas  lista
0     facebook      100  site1  1000.52    200
1      twitter      200  site1  1052.34    200
2    instagram      300  site2  2002.00    300
3      linkdim      400  site2  5000.00    800
4     facebook      500  site3   300.00    500

In [628]:
#fatiando os dados usando iloc(linhas | colunas)
dataframe.iloc[:2,2:]

    site   vendas  lista
0  site1  1000.52    200
1  site1  1052.34    200

In [629]:
#fatiar os dados usando loc(indice)
dataframe.loc[:3]

  canal_vendas  acessos   site   vendas  lista
0     facebook      100  site1  1000.52    200
1      twitter      200  site1  1052.34    200
2    instagram      300  site2  2002.00    300
3      linkdim      400  site2  5000.00    800

In [630]:
#selecionando colunas especificas
dataframe[['canal_vendas','site','vendas']]

  canal_vendas   site   vendas
0     facebook  site1  1000.52
1      twitter  site1  1052.34
2    instagram  site2  2002.00
3      linkdim  site2  5000.00
4     facebook  site3   300.00

In [631]:
#passando os valores atraves de lista
filtro = ['canal_vendas','site','vendas']

In [632]:
dataframe[filtro]

  canal_vendas   site   vendas
0     facebook  site1  1000.52
1      twitter  site1  1052.34
2    instagram  site2  2002.00
3      linkdim  site2  5000.00
4     facebook  site3   300.00

In [633]:
#usando o metodo info
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   canal_vendas  5 non-null      object
 1   acessos       5 non-null      int64
 2   site          5 non-null      object
 3   vendas        5 non-null      float64
 4   lista         5 non-null      int64
dtypes: float64(1), int64(2), object(2)
memory usage: 328.0+ bytes

In [634]:
dataframe

  canal_vendas  acessos   site   vendas  lista
0     facebook      100  site1  1000.52    200
1      twitter      200  site1  1052.34    200
2    instagram      300  site2  2002.00    300
3      linkdim      400  site2  5000.00    800
4     facebook      500  site3   300.00    500

In [635]:
#Pivotando os dados (coluna)
dataframe.pivot(index='canal_vendas', columns='site', values='acessos')

site          site1  site2  site3
canal_vendas
facebook      100.0    NaN  500.0
instagram       NaN  300.0    NaN
linkdim         NaN  400.0    NaN
twitter       200.0    NaN    NaN

In [636]:
#usando fillna para completar valores faltantes
aux = dataframe.pivot(index='canal_vendas', columns='site', values='acessos').fillna(0)
dataframe.pivot(index='canal_vendas', columns='site', values='acessos').fillna(0)

site          site1  site2  site3
canal_vendas
facebook      100.0    0.0  500.0
instagram       0.0  300.0    0.0
linkdim         0.0  400.0    0.0
twitter       200.0    0.0    0.0

In [637]:
dataframe

  canal_vendas  acessos   site   vendas  lista
0     facebook      100  site1  1000.52    200
1      twitter      200  site1  1052.34    200
2    instagram      300  site2  2002.00    300
3      linkdim      400  site2  5000.00    800
4     facebook      500  site3   300.00    500

In [638]:
#mudando colunas usando o comando melt
dataframe.melt(id_vars='site', value_vars=['canal_vendas'])

    site      variable      value
0  site1  canal_vendas   facebook
1  site1  canal_vendas    twitter
2  site2  canal_vendas  instagram
3  site2  canal_vendas    linkdim
4  site3  canal_vendas   facebook

In [639]:
aux

site          site1  site2  site3
canal_vendas
facebook      100.0    0.0  500.0
instagram       0.0  300.0    0.0
linkdim         0.0  400.0    0.0
twitter       200.0    0.0    0.0

In [640]:
#resetando o indice do dataframe
print(aux.columns)
aux = aux.reset_index()
print(aux.columns)

Index(['site1', 'site2', 'site3'], dtype='object', name='site')
Index(['canal_vendas', 'site1', 'site2', 'site3'], dtype='object', name='site')

In [641]:
aux

site canal_vendas  site1  site2  site3
0        facebook  100.0    0.0  500.0
1       instagram    0.0  300.0    0.0
2         linkdim    0.0  400.0    0.0
3         twitter  200.0    0.0    0.0

In [642]:
#exemplo do comando melt
aux.melt(id_vars='canal_vendas', value_vars=['site1', 'site2', 'site3'])

   canal_vendas   site  value
0      facebook  site1  100.0
1     instagram  site1    0.0
2       linkdim  site1    0.0
3       twitter  site1  200.0
4      facebook  site2    0.0
5     instagram  site2  300.0
6       linkdim  site2  400.0
7       twitter  site2    0.0
8      facebook  site3  500.0
9     instagram  site3    0.0
10      linkdim  site3    0.0
11      twitter  site3    0.0

In [643]:
#somando as colunas do dataframe
dataframe.sum()

canal_vendas    facebooktwitterinstagramlinkdimfacebook
acessos                                            1500
site                          site1site1site2site2site3
vendas                                          9354.86
lista                                              2000
dtype: object

In [644]:
dataframe

  canal_vendas  acessos   site   vendas  lista
0     facebook      100  site1  1000.52    200
1      twitter      200  site1  1052.34    200
2    instagram      300  site2  2002.00    300
3      linkdim      400  site2  5000.00    800
4     facebook      500  site3   300.00    500

In [645]:
#somando as linhas do dataframe
dataframe.sum(axis = 1)

0    1300.52
1    1452.34
2    2602.00
3    6200.00
4    1300.00
dtype: float64

In [646]:
#calculando a mediana das colunas numericas
print('por linha: ', dataframe.median(axis=1))
print('por coluna: ', dataframe.median())

por linha:  0    200.0
1    200.0
2    300.0
3    800.0
4    500.0
dtype: float64
por coluna:  acessos     300.00
vendas     1052.34
lista       300.00
dtype: float64

In [647]:
#calculando a media das colunas numericas
dataframe.mean()

acessos     300.000
vendas     1870.972
lista       400.000
dtype: float64

In [648]:
#calculando o desvio padrão
dataframe.std()

acessos     158.113883
vendas     1850.931024
lista       254.950976
dtype: float64

In [649]:
#verificando as estatistica descritiva dos dados
dataframe.describe()

          acessos       vendas       lista
count    5.000000     5.000000    5.000000
mean   300.000000  1870.972000  400.000000
std    158.113883  1850.931024  254.950976
min    100.000000   300.000000  200.000000
25%    200.000000  1000.520000  200.000000
50%    300.000000  1052.340000  300.000000
75%    400.000000  2002.000000  500.000000
max    500.000000  5000.000000  800.000000

In [650]:
#calculando a moda
dataframe.mode()

  canal_vendas  acessos   site   vendas  lista
0     facebook      100  site1   300.00  200.0
1          NaN      200  site2  1000.52    NaN
2          NaN      300    NaN  1052.34    NaN
3          NaN      400    NaN  2002.00    NaN
4          NaN      500    NaN  5000.00    NaN

In [651]:
# valor de maximo de uma coluna
dataframe.max()

canal_vendas    twitter
acessos             500
site              site3
vendas             5000
lista               800
dtype: object

In [652]:
# valor de minimo de uma coluna
dataframe.min()

canal_vendas    facebook
acessos              100
site               site1
vendas               300
lista                200
dtype: object

In [653]:
#printando o numero de unicos
dataframe.nunique()

canal_vendas    4
acessos         5
site            3
vendas          5
lista           4
dtype: int64

In [654]:
#contanto valores unicos de uma coluna
dataframe['canal_vendas'].value_counts()

facebook     2
linkdim      1
instagram    1
twitter      1
Name: canal_vendas, dtype: int64

In [655]:
#valores unicos de uma coluna
dataframe['canal_vendas'].unique()

array(['facebook', 'twitter', 'instagram', 'linkdim'], dtype=object)

In [656]:
#usando o groupby com valores numericos
dataframe.groupby('site')['acessos'].sum()

site
site1    300
site2    700
site3    500
Name: acessos, dtype: int64

In [657]:
#usando groupby com dados categoricos
dataframe.groupby('site')['canal_vendas'].unique()

site
site1     [facebook, twitter]
site2    [instagram, linkdim]
site3              [facebook]
Name: canal_vendas, dtype: object

In [658]:
#usando groupby com dados categoricos
dataframe.groupby('site')['canal_vendas'].first()

site
site1     facebook
site2    instagram
site3     facebook
Name: canal_vendas, dtype: object

In [659]:
#usando groupby com a função agg
dataframe.groupby('canal_vendas').agg({'site':'unique','acessos': 'sum'})

                        site  acessos
canal_vendas
facebook      [site1, site3]      600
instagram            [site2]      300
linkdim              [site2]      400
twitter              [site1]      200

In [660]:
#correlação entre variaveis
dataframe.corr()

          acessos    vendas     lista
acessos  1.000000  0.217542  0.744208
vendas   0.217542  1.000000  0.751874
lista    0.744208  0.751874  1.000000

In [661]:
#criando variaveis categoriacas por fatia de variaveis numerica
dataframe['categoria_vendas'] = pd.cut(dataframe['vendas'],bins=(0,1500,2000,8000), labels = ('0 a 1500','1500 a 2000', '2000 a 8000'))

In [662]:
dataframe

  canal_vendas  acessos   site   vendas  lista categoria_vendas
0     facebook      100  site1  1000.52    200         0 a 1500
1      twitter      200  site1  1052.34    200         0 a 1500
2    instagram      300  site2  2002.00    300      2000 a 8000
3      linkdim      400  site2  5000.00    800      2000 a 8000
4     facebook      500  site3   300.00    500         0 a 1500

In [663]:
#criando variavel categorica usando compressão de lista
dataframe['categoria_acessos'] = ['maior_que_300' if x > 300 else 'menor_que_300' for x in dataframe['acessos']]

In [664]:
dataframe

,canal_vendas,acessos,site,vendas,lista,categoria_vendas,categoria_acessos
0,facebook,100,site1,1000.52,200,0 a 1500,menor_que_300
1,twitter,200,site1,1052.34,200,0 a 1500,menor_que_300
2,instagram,300,site2,2002.00,300,2000 a 8000,menor_que_300
3,linkdim,400,site2,5000.00,800,2000 a 8000,maior_que_300
4,facebook,500,site3,300.00,500,0 a 1500,maior_que_300

In [665]:
#juntando dois dataframes | criando o dataframe 2
dataframe_2 = pd.DataFrame({'site': ['site1', 'site1', 'site2', 'site2', 'site3'], 'suporte':['carlos','carlor', 'maria', 'maria', 'ezequiel']})

In [666]:
dataframe_2

    site   suporte
0  site1    carlos
1  site1    carlor
2  site2     maria
3  site2     maria
4  site3  ezequiel

In [667]:
#realizando o merge
dataframe.merge(dataframe_2, on='site', how='left')

,canal_vendas,acessos,site,vendas,lista,categoria_vendas,categoria_acessos,suporte
0,facebook,100,site1,1000.52,200,0 a 1500,menor_que_300,carlos
1,facebook,100,site1,1000.52,200,0 a 1500,menor_que_300,carlor
2,twitter,200,site1,1052.34,200,0 a 1500,menor_que_300,carlos
3,twitter,200,site1,1052.34,200,0 a 1500,menor_que_300,carlor
4,instagram,300,site2,2002.00,300,2000 a 8000,menor_que_300,maria
5,instagram,300,site2,2002.00,300,2000 a 8000,menor_que_300,maria
6,linkdim,400,site2,5000.00,800,2000 a 8000,maior_que_300,maria
7,linkdim,400,site2,5000.00,800,2000 a 8000,maior_que_300,maria
8,facebook,500,site3,300.00,500,0 a 1500,maior_que_300,ezequiel

In [668]:
#salvando o dataframe como csv
dataframe.to_csv('dataframe.csv', sep=';', decimal=',', index=False)

In [669]:
#lendo dados no formato csv
dataframe_lido = pd.read_csv('dataframe.csv', sep=';', decimal=',')

In [670]:
dataframe_lido.head()

,canal_vendas,acessos,site,vendas,lista,categoria_vendas,categoria_acessos
0,facebook,100,site1,1000.52,200,0 a 1500,menor_que_300
1,twitter,200,site1,1052.34,200,0 a 1500,menor_que_300
2,instagram,300,site2,2002.00,300,2000 a 8000,menor_que_300
3,linkdim,400,site2,5000.00,800,2000 a 8000,maior_que_300
4,facebook,500,site3,300.00,500,0 a 1500,maior_que_300